load_tests/EC2testResult.txt
 
     done [==========================================================] 10m0s / 10m0s

    ✓ status was 200
    ✓ content was ok

    checks.....................: 100.00% ✓ 249036 ✗ 0     
    data_received..............: 326 MB  544 kB/s
    data_sent..................: 14 MB   22 kB/s
    http_req_blocked...........: avg=31.15ms  min=2µs     med=7µs   max=5.21s    p(90)=14µs  p(95)=30µs 
    http_req_connecting........: avg=313.95µs min=0s      med=0s    max=305.54ms p(90)=0s    p(95)=0s   
  ✗ http_req_duration..........: avg=3.07s    min=25.97ms med=3.57s max=12.9s    p(90)=3.85s p(95)=3.91s
    http_req_receiving.........: avg=271.37µs min=25µs    med=110µs max=206.38ms p(90)=274µs p(95)=641µs
    http_req_sending...........: avg=63.03ms  min=10µs    med=33µs  max=9.22s    p(90)=75µs  p(95)=114µs
    http_req_tls_handshaking...: avg=0s       min=0s      med=0s    max=0s       p(90)=0s    p(95)=0s   
    http_req_waiting...........: avg=3s       min=25.86ms med=3.56s max=4.1s     p(90)=3.84s p(95)=3.9s 
    http_reqs..................: 124518  207.529972/s
    iteration_duration.........: avg=4.08s    min=1.02s   med=4.57s max=13.9s    p(90)=4.85s p(95)=4.91s
    iterations.................: 124331  207.218306/s
    vus........................: 1000    min=6    max=1000
    vus_max....................: 1000    min=1000 max=1000
 
 
 
 done [==========================================================] 6m0s / 6m0s

    ✗ content was ok
     ↳  76% — ✓ 8738 / ✗ 2730
    ✗ status was 200
     ↳  76% — ✓ 8738 / ✗ 2730

    checks.....................: 76.19% ✓ 17476 ✗ 5460 
    data_received..............: 23 MB  64 kB/s
    data_sent..................: 988 kB 2.7 kB/s
    http_req_blocked...........: avg=1.27ms   min=0s     med=7µs     max=190.68ms p(90)=13µs     p(95)=42.64µs 
    http_req_connecting........: avg=1.25ms   min=0s     med=0s      max=190.05ms p(90)=0s       p(95)=0s      
  ✗ http_req_duration..........: avg=2.24s    min=0s     med=44.38ms max=1m0s     p(90)=138.71ms p(95)=230.38ms
    http_req_receiving.........: avg=193.49µs min=0s     med=100µs   max=38.73ms  p(90)=242µs    p(95)=402µs   
    http_req_sending...........: avg=500.72µs min=0s     med=31µs    max=5.28s    p(90)=71µs     p(95)=113µs   
    http_req_tls_handshaking...: avg=0s       min=0s     med=0s      max=0s       p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=2.24s    min=0s     med=44.09ms max=1m0s     p(90)=138.32ms p(95)=230.03ms
    http_reqs..................: 11468  31.855523/s
    iteration_duration.........: avg=6.96s    min=3.61ms med=1.06s   max=1m0s     p(90)=22.65s   p(95)=22.73s  
    iterations.................: 11468  31.855523/s
    vus........................: 201    min=3   max=300
    vus_max....................: 300    min=300 max=300

   
   
   
   done [==========================================================] 7m0s / 7m0s
 ✗ status was 200
↳  99% — ✓ 20380 / ✗ 66
✗ content was ok
 ↳  99% — ✓ 20380 / ✗ 66

checks.....................: 99.67% ✓ 40760 ✗ 132  
data_received..............: 54 MB  127 kB/s
data_sent..................: 2.2 MB 5.3 kB/s
http_req_blocked...........: avg=30.21ms  min=0s    med=9µs     max=23.13s   p(90)=16µs    p(95)=31µs    
http_req_connecting........: avg=30.17ms  min=0s    med=0s      max=23.13s   p(90)=0s      p(95)=0s      
✓ http_req_duration..........: avg=155.44ms min=0s    med=47.5ms  max=34.03s   p(90)=76.79ms p(95)=102.52ms
http_req_receiving.........: avg=558.54µs min=0s    med=138µs   max=311.88ms p(90)=420.5µs p(95)=1.21ms  
http_req_sending...........: avg=131.67µs min=0s    med=44µs    max=44.36ms  p(90)=105µs   p(95)=171µs   
http_req_tls_handshaking...: avg=0s       min=0s    med=0s      max=0s       p(90)=0s      p(95)=0s      
http_req_waiting...........: avg=154.75ms min=0s    med=47.11ms max=34.03s   p(90)=76.08ms p(95)=101.09ms
http_reqs..................: 20446  48.680792/s
iteration_duration.........: avg=1.2s     min=1.02s med=1.04s   max=34.03s   p(90)=1.09s   p(95)=1.12s   
iterations.................: 20351  48.454602/s
vus........................: 1      min=1   max=99 
vus_max....................: 100    min=100 max=100